andyshinn/nRF54_Bootloader/src/main.c
/*
 * The MIT License (MIT)
 *
 * Copyright (c) 2018 Ha Thach
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

/**
 * -# Receive start data packet.
 * -# Based on start packet, prepare NVM area to store received data.
 * -# Receive data packet.
 * -# Validate data packet.
 * -# Write Data packet to NVM.
 * -# If not finished - Wait for next packet.
 * -# Receive stop data packet.
 * -# Activate Image, boot application.
 *
 */
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <stddef.h>

#include "nrfx.h"
#include "nrf_clock.h"
#include "nrf_cracen.h"
#include "nrf_cracen_rng.h"
#include "nrfx_power.h"
#include "nrfx_pwm.h"

#include "sdk_common.h"
#include "bootloader.h"
#include "bootloader_util.h"

#include "nrf.h"
#include "nrf_soc.h"
#include "nrf_nvic.h"
#include "app_error.h"
#include "nrf_gpio.h"
#include "ble.h"
#include "nrf.h"
#include "ble_hci.h"
#include "app_scheduler.h"
#include "nrf_error.h"

#include "boards.h"

#include "pstorage_platform.h"
#include "nrf_mbr.h"
#include "pstorage.h"

/* nRF54L has no USB peripheral — serial DFU uses UART only */
#define usb_init(x)       led_state(STATE_USB_MOUNTED)
#define usb_teardown()

/*
 * Blinking patterns:
 * - DFU Serial     : LED Status blink
 * - DFU OTA        : LED Status & Conn blink at the same time
 * - DFU Flashing   : LED Status blink 2x fast
 * - Factory Reset  : LED Status blink 2x fast
 * - Fatal Error    : LED Status & Conn blink one after another
 */

/* Magic that written to NRF_POWER->GPREGRET by application when it wish to go into DFU
 * - DFU_MAGIC_OTA_APPJUM        : used by BLEDfu service, SD is already inited
 * - DFU_MAGIC_OTA_RESET         : entered by soft reset, SD is not inited yet
 * - DFU_MAGIC_SERIAL_ONLY_RESET : serial DFU only (UART)
 * - DFU_MAGIC_SKIP              : skip DFU entirely including double reset delay,
 *                                 Can be used with systemoff or quick reset to app
 *
 * Note: for DFU_MAGIC_OTA_APPJUM Softdevice must not initialized.
 * since it is already in application. In all other case of OTA SD must be initialized
 */
#define DFU_MAGIC_OTA_APPJUM            BOOTLOADER_DFU_START  // 0xB1
#define DFU_MAGIC_OTA_RESET             0xA8
#define DFU_MAGIC_SERIAL_ONLY_RESET     0x4e
#define DFU_MAGIC_SKIP                  0x6d

#define DFU_DBL_RESET_MAGIC             0x5A1AD5      // SALADS
#define DFU_DBL_RESET_APP               0x4ee5677e
#define DFU_DBL_RESET_DELAY             500

#define BOOTLOADER_VERSION_REGISTER     NRF_TIMER22->CC[0]
#define DFU_SERIAL_STARTUP_INTERVAL     1000

// Allow for using reset button essentially to swap between application and bootloader.
// This is controlled by a flag in the app and is the behavior of CPX and all Arcade boards when using MakeCode.
// DFU_DBL_RESET magic is used to determined which mode is entered
#define APP_ASKS_FOR_SINGLE_TAP_RESET() (*((uint32_t*)(DFU_BANK_0_REGION_START + 0x200)) == 0x87eeb07c)

#define BLEGAP_EVENT_LENGTH             12
#define BLEGATTS_HVN_QSIZE              12
#define BLEGATTC_WRCMD_QSIZE            2

//--------------------------------------------------------------------+
//
//--------------------------------------------------------------------+
/* Double-reset detection word. The address comes from ORIGIN(DBL_RESET) in the
 * board's linker script, which also keeps every output section off it; it used
 * to be a literal 0x200047F8 here that nothing tied to the region, so the two
 * could drift apart silently. */
extern uint32_t __dbl_reset_mem[];
uint32_t* dbl_reset_mem = __dbl_reset_mem;

// true if ble, false if serial
bool _ota_dfu = false;
bool _ota_connected = false;
bool _ota_was_connected = false;
bool _sd_inited = false;

/* Whether S145 is actually programmed where this build was told it lives.
 *
 * Worth asking before any sd_* call, because every one of them is an SVC that
 * src/sd_isr_nrf54l.S forwards to a handler address it reads out of a table at
 * SOFTDEVICE_BASE_ADDRESS. If the SoftDevice was never flashed, that table
 * reads as erased and the first SoftDevice call branches to 0xFFFFFFFF. The
 * SoftDevice info struct sits SOFTDEVICE_INFO_STRUCT_OFFSET into the image and
 * carries SD_MAGIC_NUMBER one word in. */
static inline bool softdevice_is_present(void) {
  uint32_t const info = SOFTDEVICE_BASE_ADDRESS + SOFTDEVICE_INFO_STRUCT_OFFSET;

  /* Bound the read first. The only vendored S145 v9.0.0 image is the nRF54L15
   * build, based at 0x00158C00, which is past the end of RRAM on the L10
   * (0x000FD000) and the L05 (0x0007D000) -- those boards have no SoftDevice
   * that fits, and reading an unmapped RRAM address bus-faults rather than
   * returning 0xFFFFFFFF. This folds to a constant per board. */
  if ((info + 8) > NRF_MEMORY_FLASH_SIZE) {
    return false;
  }

  return *(uint32_t const *)(info + 4) == SD_MAGIC_NUMBER;
}

bool is_ota(void) {
  return _ota_dfu;
}

static void check_dfu_mode(void);
static uint32_t ble_stack_init(void);

// Disable the SoftDevice if it is enabled.
static void disable_softdevice(void) {
  uint8_t sd_enabled = 0;
  sd_softdevice_is_enabled(&sd_enabled);
  if (sd_enabled == 1) {
    sd_softdevice_disable();
  }
}

//--------------------------------------------------------------------+
//
//--------------------------------------------------------------------+
int main(void) {
  // Populate Boot Address and MBR Param into MBR if not already
  // MBR_BOOTLOADER_ADDR/MBR_PARAM_PAGE_ADDR are used if available, else UICR registers are used
  // Note: skip it for now since this will prevent us to change the size of bootloader in the future
  // bootloader_mbr_addrs_populate();

