andyshinn/nRF54_Bootloader/src/main.c
  // Save bootloader version to pre-defined register, retrieved by application
  // TODO move to CF2
  BOOTLOADER_VERSION_REGISTER = (MK_BOOTLOADER_VERSION);

  board_init();
  bootloader_init();
  PRINTF("Bootloader Start\r\n");
  led_state(STATE_BOOTLOADER_STARTED);

  // When updating SoftDevice, bootloader will reset before swapping SD
  if (bootloader_dfu_sd_in_progress()) {
    led_state(STATE_WRITING_STARTED);

    bootloader_dfu_sd_update_continue();
    bootloader_dfu_sd_update_finalize();

    led_state(STATE_WRITING_FINISHED);
  }

  // Check all inputs and enter DFU if needed
  // Return when DFU process is complete (or not entered at all)
  check_dfu_mode();

  // Check if we must reenter the bootloader after reset, instead of 
  // launching the user application
  bool bootloader_must_be_reentered = bootloader_must_reset_to_self();

  // Reset peripherals
  board_teardown();

  /* Jump to application if valid
   * "Master Boot Record and SoftDevice initializaton procedure"
   * - SD_MBR_COMMAND_INIT_SD (if not already)
   * - sd_softdevice_disable()
   * - sd_softdevice_vector_table_base_set(APP_ADDR)
   * - jump to App reset
   */
  if (!bootloader_must_be_reentered && 
       bootloader_app_is_valid() && 
      !bootloader_dfu_sd_in_progress()) {
    PRINTF("App is valid\r\n");

    /* If the application jumped here with the SoftDevice already running
     * (buttonless DFU), shut it down before handing control back. This used to
     * sit behind is_sd_existed() together with an SD_MBR_COMMAND_INIT_SD call,
     * neither of which means anything on nRF54L: there is no MBR to command,
     * and the SoftDevice is never below the application. On a cold boot the
     * SoftDevice was never enabled and there is nothing to do -- and nothing to
     * ask, since sd_softdevice_is_enabled() is itself an SVC into it. */
    if (_sd_inited) {
      disable_softdevice();
    }

    // clear in case we kept DFU_DBL_RESET_APP there
    (*dbl_reset_mem) = 0;

    // start application
    PRINTF("Starting app...\r\n");
    bootloader_app_start();
  }

  // No application was loaded or we need to reenter the bootloader
  
  // Reset the system with the OTA DFU update in case we were in it, 
  // to allow completion of FLASHING, otherwise, default to normal reset
  if (_ota_was_connected) {
    NRF_POWER->GPREGRET[0] = DFU_MAGIC_OTA_RESET;
  }
  
  NVIC_SystemReset();
}

static void check_dfu_mode(void) {
  uint32_t const gpregret = NRF_POWER->GPREGRET[0];

  // SD is already Initialized in case of BOOTLOADER_DFU_OTA_MAGIC
  _sd_inited = (gpregret == DFU_MAGIC_OTA_APPJUM);

  // Start Bootloader in BLE OTA mode
  _ota_dfu = (gpregret == DFU_MAGIC_OTA_APPJUM) || (gpregret == DFU_MAGIC_OTA_RESET);

  /* ...but only if there is a SoftDevice to talk to. Serial DFU is the last way
   * back into a board that has no debugger attached, so falling back to it
   * beats faulting inside the first sd_* call. */
  if (_ota_dfu && !softdevice_is_present()) {
    PRINTF("SoftDevice not present, falling back to serial DFU\r\n");
    _ota_dfu    = false;
    _sd_inited  = false;
  }

  // Serial only mode
  bool const serial_only_dfu = (gpregret == DFU_MAGIC_SERIAL_ONLY_RESET);
  bool const dfu_skip        = (gpregret == DFU_MAGIC_SKIP);

  bool const reason_reset_pin = (NRF_RESET->RESETREAS & RESET_RESETREAS_RESETPIN_Msk) ? true : false;

  // start either serial or ble
  bool dfu_start = _ota_dfu || serial_only_dfu ||
                   (((*dbl_reset_mem) == DFU_DBL_RESET_MAGIC) && reason_reset_pin);

  // Clear GPREGRET if it is our values
  if (dfu_start || dfu_skip) {
    NRF_POWER->GPREGRET[0] = 0;
  }

  // skip dfu entirely
  if (dfu_skip) {
    return;
  }

  /*------------- Determine DFU mode (Serial, OTA, FRESET or normal) -------------*/
  // DFU button pressed
#if defined(BUTTON_DFU)
  dfu_start = dfu_start || button_pressed(BUTTON_DFU);
#endif

  // DFU + FRESET are pressed --> OTA
#if defined(BUTTON_DFU) && defined(BUTTON_DFU_OTA)
  _ota_dfu = _ota_dfu || (button_pressed(BUTTON_DFU) && button_pressed(BUTTON_DFU_OTA));
#endif

  bool const valid_app = bootloader_app_is_valid();
  bool const just_start_app = valid_app && !dfu_start && (*dbl_reset_mem) == DFU_DBL_RESET_APP;

  if (!just_start_app && APP_ASKS_FOR_SINGLE_TAP_RESET()) {
    dfu_start = 1;
  }

#ifdef DEFAULT_TO_OTA_DFU
  // Default to OTA DFU mode, instead of Serial DFU mode, if there is no app present, 
  // because otherwise, if there is no application, it will restart in Serial DFU mode,
  // making it IMPOSSIBLE to recover devices in the field if there are no user 
  // accessible USB ports
  if (!valid_app || dfu_start) {
    _ota_dfu = 1;
  }
#endif

  // App mode: Double Reset detection
  if (!(just_start_app || dfu_start || !valid_app)) {
    // Note: RESETREAS is not cleared by bootloader, it should be cleared by application upon init()
    if (reason_reset_pin) {
      // Register our first reset for double reset detection
      (*dbl_reset_mem) = DFU_DBL_RESET_MAGIC;

      // if RST is pressed during this delay (double reset)--> it will enter dfu
      NRFX_DELAY_MS(DFU_DBL_RESET_DELAY);
    }
  }

  if (APP_ASKS_FOR_SINGLE_TAP_RESET()) {
    (*dbl_reset_mem) = DFU_DBL_RESET_APP;
  } else {
    (*dbl_reset_mem) = 0;
  }

  // Enter DFU mode accordingly to input
  if (dfu_start || !valid_app) {
    if (_ota_dfu) {
      led_state(STATE_BLE_DISCONNECTED);
      /* No SD_MBR_COMMAND_INIT_SD here: nRF54L has no MBR, so that SVC had
       * nothing to reach and hung in the bootloader's own SVC_Handler.
       * sd_softdevice_enable() inside ble_stack_init() is what brings S145 up,
       * and it reaches the SoftDevice through the SVC forwarding installed by
       * src/sd_isr_nrf54l.S. */
      _sd_inited = true;
      ble_stack_init();
    } else {
      led_state(STATE_USB_UNMOUNTED);
      usb_init(serial_only_dfu);
    }

    // Initiate an update of the firmware.
    if (APP_ASKS_FOR_SINGLE_TAP_RESET() || serial_only_dfu) {
      // If serial DFU is not active in 3s, we restart into app.
      bootloader_dfu_start(_ota_dfu, 3000, true);
    } else {
      // No timeout if bootloader requires user action (double-reset).
      bootloader_dfu_start(_ota_dfu, 0, false);
    }

