andyshinn/nRF54_Bootloader/src/main.c
#if BLEGATT_ATT_MTU_MAX > 23 || defined(GPIO_PA_PIN) || defined(GPIO_LNA_PIN)
  ble_opt_t  opt;
#endif

#if BLEGATT_ATT_MTU_MAX > 23
  varclr(&opt);
  opt.common_opt.conn_evt_ext.enable = 1; // enable Data Length Extension
  sd_ble_opt_set(BLE_COMMON_OPT_CONN_EVT_EXT, &opt);
#endif

#if defined(GPIO_PA_LNA_MODE_PIN)
  // Set PA / LNA Mode Pin: Low for Normal operation
  nrf_gpio_cfg_output(GPIO_PA_LNA_MODE_PIN);
  nrf_gpio_pin_clear(GPIO_PA_LNA_MODE_PIN);
#endif

#if defined(GPIO_PA_LNA_SELECT_PIN)
  // Set PA / LNA Select Pin: low for u.FL
  nrf_gpio_cfg_output(GPIO_PA_LNA_SELECT_PIN);
  nrf_gpio_pin_clear(GPIO_PA_LNA_SELECT_PIN);
#endif

  // Configure SoftDevice PA / LNA assist if required
#if defined(GPIO_PA_PIN) || defined(GPIO_LNA_PIN)
  
  static const uint32_t gpio_toggle_ch = 0;
  static const uint32_t ppi_set_ch = 0;
  static const uint32_t ppi_clr_ch = 1;
  
  varclr(&opt);
  
  // Common PA / LNA config
  // GPIOTE channel
  opt.common_opt.pa_lna.gpiote_ch_id = gpio_toggle_ch;
  // PPI channel for pin learing
  opt.common_opt.pa_lna.ppi_ch_id_clr = ppi_clr_ch;
  // PPI channel for pin setting
  opt.common_opt.pa_lna.ppi_ch_id_set = ppi_set_ch;
  
# if defined(GPIO_PA_PIN)
  // -- PA config --
  // Set the pin to be active high
  opt.common_opt.pa_lna.pa_cfg.active_high = GPIO_PA_PIN_ACTIVE_STATE;
  // Enable toggling
  opt.common_opt.pa_lna.pa_cfg.enable = 1;
  // The GPIO pin to toggle
  opt.common_opt.pa_lna.pa_cfg.gpio_pin = GPIO_PA_PIN;
# endif

# if defined(GPIO_LNA_PIN)
  // -- LNA config --
  // Set the pin to be active high
  opt.common_opt.pa_lna.lna_cfg.active_high = GPIO_LNA_PIN_ACTIVE_STATE;
  // Enable toggling
  opt.common_opt.pa_lna.lna_cfg.enable = 1;
  
  // The GPIO pin to toggle
  opt.common_opt.pa_lna.lna_cfg.gpio_pin = GPIO_LNA_PIN;
  sd_ble_opt_set(BLE_COMMON_OPT_PA_LNA, &opt);
# endif

  // Set TX power for scan responses
  sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_SCAN_INIT, 0, RADIO_TXPOWER_TXPOWER_Neg8dBm);
  
  // Set TX power for advertisements
  sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, 0, RADIO_TXPOWER_TXPOWER_Neg8dBm);
  // (Tx power setting for connections inherit the scan or advertising power setting)
  
#endif

  return NRF_SUCCESS;
}

/*------------------------------------------------------------------*/
/* SoftDevice Event handler
 *------------------------------------------------------------------*/
extern void ble_evt_dispatch(ble_evt_t *p_ble_evt);

// Process BLE event from SD
uint32_t proc_ble(void) {
  __ALIGN(4) uint8_t ev_buf[BLE_EVT_LEN_MAX(BLEGATT_ATT_MTU_MAX)];
  uint16_t ev_len = BLE_EVT_LEN_MAX(BLEGATT_ATT_MTU_MAX);

  // Init header
  ble_evt_t* evt = (ble_evt_t*) ev_buf;
  evt->header.evt_id = BLE_EVT_INVALID;

  // Get BLE Event
  uint32_t err = sd_ble_evt_get(ev_buf, &ev_len);

  // Handle valid event, ignore error
  if (NRF_SUCCESS == err) {
    switch (evt->header.evt_id) {
      case BLE_GAP_EVT_CONNECTED: {
        // Try to enable 2M phy,if phone allows it
        ble_gap_phys_t const phys =
        {
          .rx_phys = BLE_GAP_PHY_AUTO,
          .tx_phys = BLE_GAP_PHY_AUTO,
        };
        sd_ble_gap_phy_update(evt->evt.gap_evt.conn_handle, &phys);

        _ota_connected = true;

        // Remember someone connected to BLE
        _ota_was_connected = true;
        led_state(STATE_BLE_CONNECTED);
        break;
      }

      case BLE_GAP_EVT_DISCONNECTED:
        _ota_connected = false;
        led_state(STATE_BLE_DISCONNECTED);
        break;

      default:
        break;
    }

    // from dfu_transport_ble
    ble_evt_dispatch(evt);
  }

  return err;
}

// process SOC event from SD
uint32_t proc_soc(void) {
  uint32_t soc_evt = 0;
  uint32_t err = sd_evt_get(&soc_evt);

  if (NRF_SUCCESS == err) {
    // S145 asks for fresh entropy at runtime; ignoring it stalls the stack.
    if (NRF_EVT_RAND_SEED_REQUEST == soc_evt) {
      (void) seed_softdevice_rng();
    }
    pstorage_sys_event_handler(soc_evt);
  }

  return err;
}

void proc_sd_task(void* evt_data, uint16_t evt_size) {
  (void) evt_data;
  (void) evt_size;

  // process BLE and SOC until there is no more events
  while ((NRF_ERROR_NOT_FOUND != proc_ble()) || (NRF_ERROR_NOT_FOUND != proc_soc())) {
    // nothing
  }
}

void SD_EVT_IRQHandler(void) {
  // Use App Scheduler to defer handling code in non-isr context
  app_sched_event_put(NULL, 0, proc_sd_task);
}

//--------------------------------------------------------------------+
// Error Handler
//--------------------------------------------------------------------+
void app_error_fault_handler(uint32_t id, uint32_t pc, uint32_t info) {
  volatile uint32_t *ARM_CM_DHCSR = ((volatile uint32_t *)0xE000EDF0UL); /* Cortex M CoreDebug->DHCSR */
  if ((*ARM_CM_DHCSR) & 1UL) {
    __asm("BKPT #0\n");                                                  /* Only halt mcu if debugger is attached */
  }
  NVIC_SystemReset();
}

void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name) {
  app_error_fault_handler(0xDEADBEEF, 0, 0);
}


//--------------------------------------------------------------------+
// RTT printf retarget for Debug
//--------------------------------------------------------------------+
#ifdef CFG_DEBUG
#include "SEGGER_RTT.h"

__attribute__ ((used)) int _write (int fhdl, const void *buf, size_t count) {
  (void) fhdl;
  SEGGER_RTT_Write(0, (char*) buf, (int) count);
  return count;
}

#endif
